app/controllers/admin/coleccions_controller.rb

  def create
    @admin_coleccion = Admin::Coleccion.new(params[:admin_coleccion])
    @action = 'Crear Colección'

    respond_to do |format|
      if @admin_coleccion.save
---
INSERT INTO `admin_coleccions` (`updated_at`, `nombre`, `descripcion`, `created_at`) VALUES ('2011-08-25 15:38:44', 'Coches', 'Coleccion de coches antiguos', '2011-08-25 15:38:44')

  def destroy
    @admin_coleccion = Admin::Coleccion.find(params[:id])
    @admin_coleccion.destroy
---
DELETE FROM `admin_coleccions` WHERE `admin_coleccions`.`id` = 1